cask_args appdir: "/Applications"

brew "bash"
brew "coreutils"
brew "editorconfig"
brew "findutils"
brew "git"
brew "hub"
brew "imagemagick"
brew "mas"
brew "the_silver_searcher"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "wget"
brew "yarn", args: ["without-node"]

tap "neovim/neovim"
brew "neovim", args: ["HEAD"]

tap "caskroom/cask"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "betterzip"
cask "caffeine"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "slack"
cask "sketch"
cask "spotify"
cask "textual"
cask "webpquicklook"

mas "Xcode", id: 497799835
